*** src/lib.rs:112:5: replace parse -> std::io::Result<()> with Ok(())

*** mutation diff:
--- src/lib.rs
+++ replace parse -> std::io::Result<()> with Ok(())
@@ -104,25 +104,10 @@
     }
     Ok(())
 }
 
 pub fn parse(
     path: &Path,
     results: &mut HashSet<String>,
 ) -> std::io::Result<()> {
-    if path.is_dir() {
-        for entry in WalkDir::new(path) {
-            let _entry = entry.unwrap();
-            if _entry.path().is_file() {
-                parse_file(&_entry.path(), results)?;
-            }
-        }
-        return Ok(())
-    }
-    if path.is_file() {
-       return Ok(parse_file(path, results)?);
-    }
-    Err(Error::new(
-        ErrorKind::Interrupted,
-        format!("Path \"{}\" doesn't exist.", path.display())
-    ))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- tests::keyframe_duplicates stdout ----

thread 'tests::keyframe_duplicates' panicked at tests/keyframes.rs:46:9:
assertion `left == right` failed
  left: {"@keyframes \"duplicates_test_one\" : the value \"20.15%\" already exist in file \"tests/datasets/keyframes/duplicates.css\"."}
 right: {}

---- tests::keyframe_from stdout ----

thread 'tests::keyframe_from' panicked at tests/keyframes.rs:27:9:
assertion `left == right` failed
  left: {"@keyframes \"from_test\" : the value \"from\" can be replaced by \"0%\" in file \"tests/datasets/keyframes/from.css\"."}
 right: {}

---- tests::keyframe_to stdout ----

thread 'tests::keyframe_to' panicked at tests/keyframes.rs:16:9:
assertion `left == right` failed
  left: {"@keyframes \"to_test\" : the value \"100%\" can be replaced by \"to\" in file \"tests/datasets/keyframes/to.css\"."}
 right: {}

failures:
    tests::keyframe_duplicates
    tests::keyframe_from
    tests::keyframe_to

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
