*** src/lib.rs:55:32: replace == with != in parse_keyframes_block

*** mutation diff:
--- src/lib.rs
+++ replace == with != in parse_keyframes_block
@@ -47,17 +47,17 @@
                 if keyframes_values.contains(&OrderedFloat(*unit_value)) {
                     results.insert(format!(
                         "@keyframes \"{keyframes_name}\" : the value \"{cast_unit_v}%\" already exist in file \"{}\".",
                         path.display()
                     ));
                 }
 
                 keyframes_values.insert(OrderedFloat(*unit_value));
-                if *unit_value == 1.0 {
+                if *unit_value != /* ~ changed by cargo-mutants ~ */ 1.0 {
                     results.insert(format!(
                         "@keyframes \"{keyframes_name}\" : the value \"100%\" can be replaced by \"to\" in file \"{}\".",
                         path.display()
                     ));
                 }
             }
             Token::Ident(value) => {
                 println!("&&& {:?}", value);

---- tests::keyframe_duplicates stdout ----
transform
>> Ident("transform")
:
>> Colon
translateY(
>> "translateY"
;
>> Semicolon
transform
>> Ident("transform")
:
>> Colon
translateY(

failures:
    tests::keyframe_duplicates

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
