*** src/lib.rs:64:27: replace == with != in parse_keyframes_block

*** mutation diff:
--- src/lib.rs
+++ replace == with != in parse_keyframes_block
@@ -56,17 +56,17 @@
                     results.insert(format!(
                         "@keyframes \"{keyframes_name}\" : the value \"100%\" can be replaced by \"to\" in file \"{}\".",
                         path.display()
                     ));
                 }
             }
             Token::Ident(value) => {
                 println!("&&& {:?}", value);
-                if *value == "from" {
+                if *value != /* ~ changed by cargo-mutants ~ */ "from" {
                     results.insert(format!(
                         "@keyframes \"{keyframes_name}\" : the value \"from\" can be replaced by \"0%\" in file \"{}\".",
                         path.display()
                     ));
                 }
                 // TODO : value is different than "from", "to" and a percentage.
             }
             Token::CurlyBracketBlock => {

---- tests::keyframe_without_from stdout ----
&&& "random"
transform
>> Ident("transform")
:
>> Colon
translateY(
>> "translateY"
;
>> Semicolon

thread 'tests::keyframe_without_from' panicked at tests/keyframes.rs:35:9:
assertion `left == right` failed
  left: {}

failures:
    tests::keyframe_without_from

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
