*** src/lib.rs:87:5: replace parse_file -> std::io::Result<()> with Ok(())

*** mutation diff:
--- src/lib.rs
+++ replace parse_file -> std::io::Result<()> with Ok(())
@@ -79,35 +79,17 @@
     }
     Ok(())
 }
 
 pub fn parse_file(
     path: &Path,
     results: &mut HashSet<String>,
 ) -> std::io::Result<()> {
-    let contents = fs::read_to_string(path)?;
-    let mut input = ParserInput::new(&contents);
-    let mut parser = Parser::new(&mut input);
-    let mut last_keyframes_name = "".to_string();
-
-    while let Ok(token) = parser.next() {
-        match token {
-            Token::CurlyBracketBlock => {
-                let _ = parser.parse_nested_block(|input| {
-                    parse_keyframes_block(path, &last_keyframes_name, results, input)
-                });
-            }
-            Token::Ident(name) => {
-                last_keyframes_name = name.to_string();
-            }
-            _ => {}
-        }
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn parse(
     path: &Path,
     results: &mut HashSet<String>,
 ) -> std::io::Result<()> {
     if path.is_dir() {
         for entry in WalkDir::new(path) {

---- tests::keyframe_duplicates stdout ----

thread 'tests::keyframe_duplicates' panicked at tests/keyframes.rs:46:9:
assertion `left == right` failed
  left: {"@keyframes \"duplicates_test_one\" : the value \"20.15%\" already exist in file \"tests/datasets/keyframes/duplicates.css\"."}
 right: {}

---- tests::keyframe_to stdout ----

thread 'tests::keyframe_to' panicked at tests/keyframes.rs:16:9:
assertion `left == right` failed
  left: {"@keyframes \"to_test\" : the value \"100%\" can be replaced by \"to\" in file \"tests/datasets/keyframes/to.css\"."}
 right: {}

---- tests::keyframe_from stdout ----

thread 'tests::keyframe_from' panicked at tests/keyframes.rs:27:9:
assertion `left == right` failed
  left: {"@keyframes \"from_test\" : the value \"from\" can be replaced by \"0%\" in file \"tests/datasets/keyframes/from.css\"."}
 right: {}

failures:
    tests::keyframe_duplicates
    tests::keyframe_from
    tests::keyframe_to

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
