*** src/main.rs:17:5: replace main with ()

*** mutation diff:
--- src/main.rs
+++ replace main with ()
@@ -9,17 +9,10 @@
 #[derive(Parser, Debug)]
 #[command(version, about, long_about = None)]
 struct Cli {
     #[arg(short, long, value_name = "FILE")]
     path: PathBuf,
 }
 
 fn main() {
-    let cli = Cli::parse();
-    
-    let mut results: HashSet<String> = HashSet::new();
-    let _ = parse(&cli.path, &mut results);
-
-    for result in results {
-        println!("{}", result.white().on_red());
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
